---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ElectricalSystem
source: html/158b4be3-bbe5-11eb-cccc-788edd3a7590.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem

Provides access to the Electrical System in Autodesk Revit MEP.

## Syntax (C#)
```csharp
public class ElectricalSystem : MEPSystem
```

## Remarks
The Electrical System object can only be queried in Autodesk Revit MEP.